/*********************************************************************************************************
* 模块名称：GUIPlatform.h
* 摘    要：GUI平台配置模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _GUI_PLATFORM_H_
#define _GUI_PLATFORM_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "GUIConf.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/
//线条类型定义
typedef enum
{
  GUI_LINE_SQUARE, //两端方形
  GUI_LINE_CIRCLE, //两端圆形
}EnumGUILineType;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
//画点函数
void GUIDrawPoint(u32 x, u32 y, u32 size, u32 color);

//读点函数
u32 GUIReadPoint(u32 x, u32 y);

//画线函数
void GUIDrawLine(u32 x0, u32 y0, u32 x1, u32 y1, u32 size, u32 color, EnumGUILineType type);

//单色填充
void GUIFillColor(u32 x0, u32 y0, u32 x1, u32 y1, u32 color);

//显示字符
void GUIDrawChar(u32 x, u32 y, u32 code, EnumGUIFont font, u32 backColor,u32 textColor, u32 mode);

//显示一行字符串
void GUIDrawTextLine(u32 x, u32 y, u32 string, EnumGUIFont font, u32 backColor,u32 textColor, u32 mode, u32 len);

//保存背景
void GUISaveBackground(u32 x0, u32 y0, u32 width, u32 height, u32 buf);

//绘制背景
void GUIDrawBackground(u32 x0, u32 y0, u32 width, u32 height, u32 buf);

//绘制图片
void GUIDrawImage(u32 x0, u32 y0, u32 image, EnumGUIImageType type);

//系统时间
u64 GUIGetSysTime(void);

//获取触点
u8 GUIGetTouch(u32* x, u32* y, u32 cnt);

//获取字符宽度
u32 GetFontWidth(EnumGUIFont font);

//获取字符高度
u32 GetFontHeight(EnumGUIFont font);

#endif
