/*********************************************************************************************************
* 模块名称：Touch.c
* 摘    要：触摸屏检测驱动模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Touch.h"
#include "GT1151Q.h"
#include "stdio.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define DIFFERENCE_MAX 75  //坐标点之间差值最大值

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量定义
*********************************************************************************************************/
static StructTouchDev s_structTouchDev;

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static u16 Abs(u16 a, u16 b); //计算两数之差绝对值

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：Abs
* 函数功能：计算两数之差绝对值
* 输入参数：a，b：数据输入
* 输出参数：void
* 返 回 值：两数之差绝对值
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static u16 Abs(u16 a, u16 b)
{
  if(a > b)
  {
    return (a - b);
  }
  else
  {
    return (b - a);
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitTouch
* 函数功能：初始化触摸屏模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitTouch(void)
{
  u8 i;

  //初始化GT1151Q触摸屏驱动模块
  InitGT1151Q();

  //初始化s_structTouchDev结构体
  s_structTouchDev.pointNum = 0;
  for(i = 0; i < POINT_NUM_MAX; i++)
  {
    s_structTouchDev.pointFlag[i] = 0;
    s_structTouchDev.point[i].x = 0xFFFF;
    s_structTouchDev.point[i].y = 0xFFFF;
    s_structTouchDev.point[i].size = 0;
  }
}

/*********************************************************************************************************
* 函数名称：ScanTouch
* 函数功能：触摸屏扫描
* 输入参数：void
* 输出参数：void
* 返 回 值：触点个数
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u8 ScanTouch(void)
{
  static StructTouchDev s_structNewDev; //当前触摸屏扫描结果
  u8 i, j;                              //循环变量
  u16 x0, y0, x1, y1;                   //坐标变量
  u8 hasSimilarity;                     //查找到相似点标志位，0-无相似点，1-有相似点
  u8 hasClearFlag[POINT_NUM_MAX];       //已清除标志位

  //清空hasClearFlag
  for(i = 0; i < POINT_NUM_MAX; i++)
  {
    hasClearFlag[i] = 0;
  }

  //获取当前触摸屏检测结果
  ScanGT1151Q(&s_structNewDev);

  //更新触摸点个数
  s_structTouchDev.pointNum = s_structNewDev.pointNum;

  //第一遍，查看New中有没有Touch的相似点，若是有则更新该点，若是没有则标记Touch该点未触碰
  for(i = 0; i < POINT_NUM_MAX; i++)
  {
    if(1 == s_structTouchDev.pointFlag[i])
    {
      //默认未查找到相似点
      hasSimilarity = 0;
      for(j = 0; j < POINT_NUM_MAX; j++)
      {
        if(1 == s_structNewDev.pointFlag[j])
        {
          x0 = s_structTouchDev.point[i].x;
          y0 = s_structTouchDev.point[i].y;
          x1 = s_structNewDev.point[j].x;
          y1 = s_structNewDev.point[j].y;

          //查找到相似点
          if((Abs(x0, x1) <= DIFFERENCE_MAX) && (Abs(y0, y1) <= DIFFERENCE_MAX))
          {
            //标记查找到相似点
            hasSimilarity = 1;

            //保存测量结果
            s_structTouchDev.point[i].x = s_structNewDev.point[j].x;
            s_structTouchDev.point[i].y = s_structNewDev.point[j].y;
            s_structTouchDev.point[i].size = s_structNewDev.point[j].size;
            s_structTouchDev.pointFlag[i]  = 1;

            //跳出循环
            break;
          }
        }
      }

      //未在New中发现当前Touch相似点，则标记当前点为未触碰
      if(0 == hasSimilarity)
      {
        //标记当前点未触碰
        s_structTouchDev.pointFlag[i] = 0;

        //标记该点清零过
        hasClearFlag[i] = 1;
      }
    }
  }

  //第二遍，查看Touch中有无New相似点，若没有则表示这是一个新触点，将新触点保存到Touch中
  for(i = 0; i < POINT_NUM_MAX; i++)
  {
    if(1 == s_structNewDev.pointFlag[i])
    {
      //默认未找到相似点
      hasSimilarity = 0;
      for(j = 0; j < POINT_NUM_MAX; j++)
      {
        if(1 == s_structTouchDev.pointFlag[j])
        {
          x0 = s_structNewDev.point[i].x;
          y0 = s_structNewDev.point[i].y;
          x1 = s_structTouchDev.point[j].x;
          y1 = s_structTouchDev.point[j].y;

          //查找到相似点
          if((Abs(x0, x1) <= DIFFERENCE_MAX) && (Abs(y0, y1) <= DIFFERENCE_MAX))
          {
            hasSimilarity = 1;
            break;
          }
        }
      }

      //若未发现相似点，则表明这是新的触摸点，将新触点保存到Touch中
      if(0 == hasSimilarity)
      {
        //查找空的位置并填入
        for(j = 0; j < POINT_NUM_MAX; j++)
        {
          if((0 == s_structTouchDev.pointFlag[j]) && (0 == hasClearFlag[j]))
          {
            s_structTouchDev.point[j].x = s_structNewDev.point[i].x;
            s_structTouchDev.point[j].y = s_structNewDev.point[i].y;
            s_structTouchDev.point[j].size = s_structNewDev.point[i].size;
            s_structTouchDev.pointFlag[j] = 1;
            break;
          }
        }
      }
    }
  }

  return s_structTouchDev.pointNum;
}

/*********************************************************************************************************
* 函数名称：GetTouchDev
* 函数功能：获取触摸按键设备结构体地址
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
StructTouchDev* GetTouchDev(void)
{
  return &s_structTouchDev;
}
