/*********************************************************************************************************
* 模块名称：SliderWidget.h
* 摘    要：滑条控件模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _SLIDER_WIDGET_H_
#define _SLIDER_WIDGET_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "GUIConf.h"
#include "GUIPlatform.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
//滑条控件
typedef struct
{
  u32   x0;          //起始横坐标
  u32   y0;          //起始纵坐标
  u32   width;       //宽度，宽度必须大于长度
  u32   height;      //高低，宽度必须大于长度
  u32   value;       //滑条当前位置，0-100
  void* lineImage;   //滑条横线图片，为了显示透明图片，在这里选用位图
  void* circleImage; //滑条圆点图片，为了显示透明图片，在这里选用位图
  u32   lineSize;    //滑条横线粗细，具体为2*lineSize个像素点（lineImage为NULL时使用）
  u32   lineColor;   //滑条横线颜色（lineImage为NULL时使用）
  u32   circleColor; //滑条原点颜色，圆点直径默认为控件高度（circleImage为NULL时使用）
  u32   background;  //背景缓冲区首地址，用户提供，需是静态数组，需4字节对齐
}StructSliderWidget;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void InitSliderWidgetStruct(StructSliderWidget* widget); //设置滑条控件结构体默认值
u8   CreateSliderWidget(StructSliderWidget* widget);     //创建滑条控件
void ScanSliderWidget(StructSliderWidget* widget);       //滑条扫描
void DeleteSliderWidget(StructSliderWidget* widget);     //删除滑条控件

#endif
