/*********************************************************************************************************
* 模块名称：BMP.h
* 摘    要：位图显示模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _BMP_H_
#define _BMP_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define BMP_READ_SIZE (u32)(1024) //一次读取最大数据量

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/
//位图使用透明度算法枚举
typedef enum
{
  BMP_UES_ALPHA,  //使用透明度叠加算法，适合小图片显示，大图片使用透明度叠加会很慢
  BMP_GATE_ALPHA, //过滤掉透明度较低的像素点不显示，只显示透明度高的像素点
  BMP_NO_ALPHA    //不使用透明度算法，所有像素点均显示
}EnumBmpAlphaType;

//位图储存位置枚举
typedef enum
{
  BMP_IN_MEM,   //储存在内部内存中的位图
  BMP_IN_FATFS, //储存在文件系统中的位图
}EnumBmpStorageType;

//位图设备结构体
typedef struct
{
  EnumBmpAlphaType   alphaType;   //透明度类型
  u8                 alphaGate;   //透明度阈值，当透明度类型为BMP_GATE_ALPHA时，大于等于该阈值的像素点将被显示
  EnumBmpStorageType storageType; //储存类型
  void*              addr;        //储存地址或路径
}StructBmpImage;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void InitBMP(void);                                   //初始化位图显示模块
void DisplayBMP(StructBmpImage* image, u32 x, u32 y); //指定位置显示位图
void DisPlayBMPByIPA(u32 x, u32 y, char* addr);       //使用IPA图像处理加速器绘制位图
void GetBMPSize(StructBmpImage* image, u32* width, u32* height); //获取位图信息

#endif
