/*********************************************************************************************************
* 模块名称：GUIRadio.c
* 摘    要：单选模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "GUIRadio.h"
#include "TLILCD.h"
#include "RadioWidget.h"
#include "Malloc.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static StructRadioWidget s_arrRadio[GUI_RADIO_MAX];

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void RadioPressCallback(void* radio);  //单选回调函数

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：RadioPressCallback
* 函数功能：单选回调函数
* 输入参数：radio：被按下的单选控件地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：有且仅有一个单选控件能获取焦点
*********************************************************************************************************/
static void RadioPressCallback(void* radio)
{
  u8 i;
  for(i = 0; i < GUI_RADIO_MAX; i++)
  {
    if((StructRadioWidget*)radio != &s_arrRadio[i])
    {
      //取消控件焦点状态
      ClearRadioWidgetFocus(&s_arrRadio[i]);
    }
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitGUIRadio
* 函数功能：初始化单选模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitGUIRadio(void)
{
  //单选控件坐标
  static const u16 s_arrX0[GUI_RADIO_MAX] = {43, 204, 365, 42 , 365};  //横坐标
  static const u16 s_arrY0[GUI_RADIO_MAX] = {17, 20 , 20  , 645, 645}; //纵坐标
  u32 i;

  //创建单选控件
  for(i = 0; i < GUI_RADIO_MAX; i++)
  {
    InitRadioWidgetStruct(&s_arrRadio[i]);
    s_arrRadio[i].x0 = s_arrX0[i];
    s_arrRadio[i].y0 = s_arrY0[i];
    s_arrRadio[i].width = 75;
    s_arrRadio[i].height = 75;
    s_arrRadio[i].type = RADIO_TYPE_LINE;
    s_arrRadio[i].lineColor = GUI_COLOR_WHITE;
    s_arrRadio[i].lineSize = 4;
    s_arrRadio[i].background = MyMalloc(SDRAMEX, s_arrRadio[i].width * s_arrRadio[i].height * 2);
    s_arrRadio[i].pressCallback = RadioPressCallback;
    CreateRadioWidget(&s_arrRadio[i]);
  }

}

/*********************************************************************************************************
* 函数名称：ScanGUIRadio
* 函数功能：单选模块扫描
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
EnumGUIRadio ScanGUIRadio(void)
{
  u32 i;
  EnumGUIRadio result;

  //扫描
  for(i = 0; i < GUI_RADIO_MAX; i++)
  {
    ScanRadioWidget(&s_arrRadio[i]);
  }

  //获取具有焦点的控件ID
  result = GUI_RADIO_NONE;
  for(i = 0; i < GUI_RADIO_MAX; i++)
  {
    if(RADIO_HAS_FOCUS == s_arrRadio[i].hasFocus)
    {
      result = (EnumGUIRadio)i;
      break;
    }
  }

  //返回
  return result;
}

