/*********************************************************************************************************
* 模块名称：InfoWidget.h
* 摘    要：信息窗口控件
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _INFO_WIDGET_H_
#define _INFO_WIDGET_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "GUIConf.h"
#include "GUIPlatform.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
//信息窗口控件
typedef struct
{
  //共有成员变量
  u32              x0, y0, width, height;                //控件位置以及大小
  u32              topOff, bottomOff, leftOff, rightOff; //上下左右显示与边沿间距
  EnumGUIFont      textFont;                             //字体大小
  u32              textColor, textHeight;                //字体颜色和字符高度
  void*            background;                           //背景保存，实现透明效果时必须要提供
  void*            image;                                //显示图片
  EnumGUIImageType imageType;                            //图片格式
  u32              defaultBackColor;                     //默认的背景颜色，image为NULL时使用

  //私有成员变量，用户不可更改
  u32 showX0, showY0, showX1, showY1, showWidth, showHeight; //显示区域大小
  u32 isExist; //控件是否处在活动状态标志位，0-控件处于非活动状态，1-控件正处于活动状态
  u32 isShow;  //控件是否正在显示内容，0-并未显示任何内容，1-正在显示信息
}StructInfoWidget;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void InitInfoWidgetStruct(StructInfoWidget* widget);          //设置各项参数默认值
void CreateInfoWidget(StructInfoWidget* widget);              //创建控件
void DeleteInfoWidget(StructInfoWidget* widget);              //删除控件
void SetInfoWidgetShow(StructInfoWidget* widget, char* text); //设置信息框显示内容
u32  ScanInfoWidget(StructInfoWidget* widget);                //控件扫描
void SetInfoWidgetOff(StructInfoWidget* widget, u32 off);     //设置控件显示区域大小

#endif
