/*********************************************************************************************************
* 模块名称：BookByteRead.h
* 摘    要：按字节从文本文件中读取数据模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：SD卡读写是以数据块的形式进行，每次读写512个字节，为了提高SD卡读写效率，需要用专门的模块控制SD卡读写
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "BookByteRead.h"
#include "ff.h"
#include "stdio.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define BOOK_READ_BUF_SIZE (1024 * 5) //SD卡单词读取数据量（需要是4的整数倍）

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static FIL  s_fileBook;                       //文本文件
static char s_arrReadBuf[BOOK_READ_BUF_SIZE]; //读取缓冲区
static u32  s_iByteRemain = 0;                //缓冲区中剩余字节数，为0时表示需要从文件中读取数据了
static u32  s_iEndFlag    = 0;                //文件读取完毕标志位，为1时表示文件中的内容已被全部读取
static u32  s_iFilePos    = 0;                //文件读取位置
static u32  s_iByteCnt    = 0;                //读取字节计数
static u32  s_iBookSize   = 0;                //书本大小（字节）

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static u32 ReadData(void); //读入一批数据

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ReadData
* 函数功能：读入一批数据
* 输入参数：void
* 输出参数：void
* 返 回 值：1-读取成功，0-读取失败
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static u32 ReadData(void)
{
  //文件操作返回值
  FRESULT result;

  //循环变量
  u32 i;

  //打开文件
  result = f_open(&s_fileBook, "0:/book/西游记.txt", FA_OPEN_EXISTING | FA_READ);
  if (result !=  FR_OK)
  {
    printf("BookByteRead: 打开指定文件失败\r\n");
    return 0;
  }

  //设置读取位置（要确保读取位置为4的倍数，不然会卡死）
  result = f_lseek(&s_fileBook, s_iFilePos * BOOK_READ_BUF_SIZE);
  if (result !=  FR_OK)
  {
    printf("BookByteRead: 设置读取位置失败\r\n");
    return 0;
  }

  //清缓冲区
  for(i = 0; i < BOOK_READ_BUF_SIZE; i++)
  {
    s_arrReadBuf[i] = 0;
  }

  //读取一批数据
  result = f_read(&s_fileBook, s_arrReadBuf, BOOK_READ_BUF_SIZE, &s_iByteRemain);
  if (result !=  FR_OK)
  {
    printf("BookByteRead: 读取数据失败\r\n");
    return 0;
  }

  //更新读取位置
  s_iFilePos = s_iFilePos + 1;

  //判断是不是文件中最后一批数据
  if(s_fileBook.fptr >= s_fileBook.fsize)
  {
    s_iEndFlag = 1;
  }

  //保存图书大小
  s_iBookSize = s_fileBook.fsize;

  //关闭文件
  result = f_close(&s_fileBook);
  if (result !=  FR_OK)
  {
    printf("BookByteRead: 关闭指定文件失败\r\n");
    return 0;
  }

  return 1;
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ReadBookByte
* 函数功能：获取1字节数据
* 输入参数：byte：读出数据储存区域，visi：当前字符开始往后有多少个可视字符（不含当前字符）
* 输出参数：void
* 返 回 值：1-读取成功，0-读取失败
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u32 ReadBookByte(char* byte, u32* visi)
{
  u32 result;  //文件操作返回值
  u32 visible; //可视字符统计

  //当前缓冲区中剩余字节数为0，需要读取新一批数据
  if((0 == s_iByteRemain) && (0 == s_iEndFlag))
  {
    //读取一批数据
    result = ReadData();
    if(0 == result)
    {
      return 0;
    }

    //读取字节计数清零
    s_iByteCnt = 0;
  }

  //当前缓冲区中剩余字节数为0，而且文件已全部读取完毕
  else if((0 == s_iByteRemain) && (1 == s_iEndFlag))
  {
    return 0;
  }

  //输出字节数据
  *byte = s_arrReadBuf[s_iByteCnt];

  //可视字符统计
  visible = 0;
  while(1)
  {
    //检查数组是否越界
    if((s_iByteCnt + visible + 1) >= BOOK_READ_BUF_SIZE)
    {
      break;
    }

    //查找到了非可视字符
    if(s_arrReadBuf[s_iByteCnt + visible + 1] <= ' ')
    {
      break;
    }
    visible++;
  }
  *visi = visible;

  //更新计数
  s_iByteCnt++;
  s_iByteRemain--;

  //读取成功
  return 1;
}

/*********************************************************************************************************
* 函数名称：GetBytePosition
* 函数功能：获取当前字节在文本文件中的位置
* 输入参数：void
* 输出参数：void
* 返 回 值：获取当前字节在文本文件中的位置
* 创建日期：2021年07月01日
* 注    意：当前字节指的是将要读取的字节
*********************************************************************************************************/
u32 GetBytePosition(void)
{
  //还未从SD卡读取任何数据
  if(0 == s_iFilePos)
  {
    return 0;
  }
  else
  {
    return ((s_iFilePos - 1) * BOOK_READ_BUF_SIZE + s_iByteCnt);
  }
}

/*********************************************************************************************************
* 函数名称：SetPosision
* 函数功能：设置读取位置
* 输入参数：void
* 输出参数：void
* 返 回 值：1-设置成功，0-设置失败
* 创建日期：2021年07月01日
* 注    意：这里的读取位置是指文件中的读取位置
*********************************************************************************************************/
u32 SetPosision(u32 posision)
{
  //读取位置超过文件大小
  if((posision >= s_iBookSize) && (0 != s_iBookSize))
  {
    return 0;
  }

  //读入新一批数据
  s_iFilePos = posision / BOOK_READ_BUF_SIZE;
  if(0 == ReadData())
  {
    return 0;
  }

  //更新读取字节计数
  s_iByteCnt = posision % BOOK_READ_BUF_SIZE;

  //更新缓冲区剩余量
  s_iByteRemain = s_iByteRemain - s_iByteCnt;

  return 1;
}

/*********************************************************************************************************
* 函数名称：GetBookSize
* 函数功能：获取书本大小
* 输入参数：void
* 输出参数：void
* 返 回 值：书本大小（字节）
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u32 GetBookSize(void)
{
  return s_iBookSize;
}
