/*********************************************************************************************************
* 模块名称：GraphWidget.h
* 摘    要：波形控件模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _GRAPH_WIDGET_
#define _GRAPH_WIDGET_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "GUIPlatform.h"
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
typedef struct
{
  unsigned int  x0;        //控件左上角绝对横坐标
  unsigned int  y0;        //控件左上角绝对纵坐标
  unsigned int  x1;        //控件右下角绝对横坐标
  unsigned int  y1;        //控件右下角绝对纵坐标
  unsigned int  xOld;      //上一个点的绝对横坐标
  unsigned int  yOld;      //上一个点的绝对纵坐标
  unsigned int  curPos;    //当前位置
  unsigned int  backColor; //背景颜色
  unsigned int  penColor;  //画笔颜色
  unsigned char hasCreate; //初始化表示，0-未初始化，1-以经初始化
  unsigned char startDraw; //开始绘制标志，0-不绘图，1-绘图
  unsigned char firstFlag; //绘制第一个点标志位
  unsigned char WaveRatio; //波形幅值比例（n份之1）
  unsigned char WaveSpeed; //绘制速度，（每隔多少个像素点画一个点）
  unsigned char WavePos;   //用于控制波形上下移动
  void (*callBack)(void);  //绘图结束后回调函数
}StructGraphObj;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void InitGraphWidgetStruct(StructGraphObj* graph);                                   //初始化控件结构体
void CreateGraphWidget(int x0, int y0, int xSize, int ySize, StructGraphObj* graph); //创建波形控件
void GraphWidgetAddData(StructGraphObj* graph, unsigned int data);                   //波形增加点

#endif

