/*********************************************************************************************************
* 模块名称：GUIBreathLED.c
* 摘    要：呼吸灯显示模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "GUIBreathLED.h"
#include "TLILCD.h"
#include "GUIPlatform.h"
#include "GraphWidget.h"
#include "BMP.h"
#include "Common.h"
#include "SliderWidget.h"
#include "BreathLED.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static StructSliderWidget s_structSlider;    //滑条控件
static u16 s_arrSliderBackground[20 * 1024]; //滑条背景缓冲区

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：CreateGUIBreathLED
* 函数功能：创建呼吸灯显示模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void CreateGUIBreathLED(void)
{
  static StructBmpImage s_structPoint;

  //LCD横屏显示
  LCDDisplayDir(LCD_SCREEN_HORIZONTAL);

  //绘制背景
  DisPlayBMPByIPA(0, 0, BREATH_LED_BACKGROUND_DIR);

  //初始化呼吸灯
  InitBreathLED();

  //创建滑条控件
  s_structPoint.alphaType = BMP_UES_ALPHA;
  s_structPoint.storageType = BMP_IN_FATFS;
  s_structPoint.addr = (void*)BREATH_LED_POINT_DIR;
  InitSliderWidgetStruct(&s_structSlider);
  s_structSlider.x0          = 100;                        //起始横坐标
  s_structSlider.y0          = 300;                        //起始纵坐标
  s_structSlider.width       = 600;                        //宽度
  s_structSlider.height      = 30;                         //高度
  s_structSlider.value       = 50;                         //滑条预设置（0-100）
  s_structSlider.lineImage   = NULL;                       //线条不使用刷图片方式
  s_structSlider.circleImage = (void*)&s_structPoint;      //滑条圆点图片
  s_structSlider.lineSize    = 4;                          //横线宽度为4
  s_structSlider.lineColor   = 0xFDCA;                     //线条颜色
  s_structSlider.circleColor = 0xFDCA;                     //圆点颜色
  s_structSlider.background  = (u32)s_arrSliderBackground; //背景缓冲区
  CreateSliderWidget(&s_structSlider);                     //创建滑条控件
}

/*********************************************************************************************************
* 函数名称：DeleteGUIBreathLED
* 函数功能：删除呼吸灯显示模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void DeleteGUIBreathLED(void)
{
  DeInitBreathLED();
}

/*********************************************************************************************************
* 函数名称：GUIBreathLEDPoll
* 函数功能：呼吸灯轮询任务
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void GUIBreathLEDPoll(void)
{
  u32 period;

  //滑动条扫描
  ScanSliderWidget(&s_structSlider);

  //获取呼吸灯周期
  period = 2500 * s_structSlider.value / 100;
  if(period < 50)
  {
    period = 50;
  }

  //呼吸灯任务
  BreathLEDTask(period);
}
